# https://t.me/wangcai_8
# https://github.com/suiyuan8/clash

#░██╗░░░░░██╗░░█████╗░░███╗░██╗░░██████╗░░█████╗░█████╗ █████╗░
#░██║░░░░░██║░██╔══██╗░████╗██║██╔════╝░██╔════╝██╔══██╗░██░ ║░
#░██║░██╔═██║░███████║░██╔████║██║░░██╗░██║░░░░░███████║░██░ ║░
#░╚██╗██║██╔╝░██╔══██║░██║╚███║██║░░╚██╗██║░░░░░██╔══██║░██░ ║░
#░░╚███║███╔╝░██║░░██║░██║░╚██║╚██████╔╝░░█████╝██║░░██║█████ ░
#░░░╚══╝╚══╝░░╚═╝░░╚═╝░░╚═╝░░╚═╝░╚═════╝░░╚════╝  ░╚═╝░╚╝╚═══╝ ░
#
port: 7890
socks-port: 7891
allow-lan: true
mode: Rule
log-level: info
external-controller: 127.0.0.1:9090
proxies:
  - {name: 🇺🇸US_1 @WangCai_8, server: 67.209.184.60, port: 15325, client-fingerprint: chrome, type: ss, cipher: aes-256-gcm, password: 9GfXqoYsCCGkogps, tfo: false}
  - {name: 🇺🇸US_2 @WangCai_8, server: 67.209.177.36, port: 15325, client-fingerprint: chrome, type: ss, cipher: aes-256-gcm, password: 9GfXqoYsCCGkogps, tfo: false}
proxy-groups:
  - name: 旺财节点
    type: select
    proxies:
      - 🇺🇸US_1 @WangCai_8
      - 🇺🇸US_2 @WangCai_8
rules:
  - GEOIP,CN,DIRECT
  - MATCH,旺财节点
  
